//([a-fA-F0-9]{24},)* - ця частина визначає шаблон для ідентифікаторів, розділених
//комою. Ідентифікатор складається з 24 символів, які можуть бути літерами (a-f, A-F)
//та цифрами (0-9). Ця частина означає, що може бути довільна кількість
//ідентифікаторів, розділених комою, від нуля до нескінченності.

//[a-fA-F0-9]{24} - ця pacha визначає шаблон для останнього ідентифікатора в
//рядку. Як і раніше, ідентифікатор складається з 24 символів, які можуть бути літерами
//(a-f, A-F) та цифрами (0-9).

export const idListReg = {
  value: /^([a-fA-F0-9]{24},)*[a-fA-F0-9]{24}$/,
  message: 'Not a valid value',
};
